CREATE OR REPLACE PACKAGE UWZ."PKG_FAMF0010"


AS

    /******************************************************************************
       NAME:       PKG_FAMF0010
       PURPOSE:    재무제표
       REVISIONS:
       Ver        Date        Author           Description
       ---------  ----------  ---------------  ------------------------------------
       1.0        2016-02-05    하창연         1. Created this package.
    ******************************************************************************/

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 재무제표 생성
    ********************************************************************************/
    PROCEDURE SP_SAVE00 (
         IN_UPDT_USID    IN VARCHAR2                   /* 작업자 */
        ,IN_BASE_YYM1    IN VARCHAR2                   /* 당기시작월 */
        ,IN_BASE_YYM2    IN VARCHAR2                   /* 당기종료월 */
        ,IN_PREV_YYM1    IN VARCHAR2                   /* 전기시작월 */
        ,IN_PREV_YYM2    IN VARCHAR2                   /* 전기종료월 */
        ,IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
        ,IN_ACCT_UNIT    IN VARCHAR2                   /* 회계단위 */
        ,IN_ACCT_GUBN    IN VARCHAR2                   /* 사업장 */
        ,IN_VIEW_ITLV    IN VARCHAR2                   /* 양식항목레벨 */
        ,IN_MONT_FLAG    IN VARCHAR2 DEFAULT ''         /* 월별자료여부 : Y / NULL */
    );

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 계정별합계
    ********************************************************************************/
    PROCEDURE SP_ACCT_SUM (
         IN_UPDT_USID    IN VARCHAR2                   /* 작업자 */
        ,IN_ACCT_DAT1    IN VARCHAR2                   /* 회계일자 */
        ,IN_ACCT_DAT2    IN VARCHAR2                   /* 회계일자 */
        ,IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
        ,IN_ACCT_UNIT    IN VARCHAR2                   /* 회계단위 */
        ,IN_ACCT_GUBN    IN VARCHAR2                   /* 사업장 */
        ,IN_YEAR_GUBN    IN VARCHAR2                   /* 당기전기구분 */
    );

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 기본양식 생성
    ********************************************************************************/
    PROCEDURE SP_TEMP_INSERT (
         IN_ACCT_DATE    IN VARCHAR2                   /* 회계일자 */
        ,IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
    );

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 계정별합계(합계잔액시산표)
    ********************************************************************************/
    PROCEDURE SP_SAVE_TB (
         IN_UPDT_USID    IN VARCHAR2                   /* 작업자 */
        ,IN_ACCT_DAT1    IN VARCHAR2                   /* 회계일자 */
        ,IN_ACCT_DAT2    IN VARCHAR2                   /* 회계일자 */
        ,IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
        ,IN_ACCT_UNIT    IN VARCHAR2                   /* 회계단위 */
        ,IN_ACCT_GUBN    IN VARCHAR2                   /* 사업장 */
    );

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 항목별합계(합계잔액시산표)
    ********************************************************************************/
    PROCEDURE SP_TB_ITCD_SUM (
         IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
        ,IN_VIEW_ITCD    IN VARCHAR2                   /* 양식항목 */
        ,IN_DRCR_GUBN    IN VARCHAR2                   /* 차대구분 */
    );

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 항목 집계
    ********************************************************************************/
    PROCEDURE SP_ITCD_START (
         IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
    );

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 항목 집계
    ********************************************************************************/
    PROCEDURE SP_ITCD_SUM (
         IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
        ,IN_VIEW_ITCD    IN VARCHAR2                   /* 양식항목코드 */
    );

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 재무상태표 생성
    ********************************************************************************/
    PROCEDURE SP_SAVE_BS (
         IN_UPDT_USID    IN VARCHAR2                   /* 작업자 */
        ,IN_BASE_YYM1    IN VARCHAR2                   /* 당기시작월 */
        ,IN_BASE_YYM2    IN VARCHAR2                   /* 당기종료월 */
        ,IN_PREV_YYM1    IN VARCHAR2                   /* 전기시작월 */
        ,IN_PREV_YYM2    IN VARCHAR2                   /* 전기종료월 */
        ,IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
        ,IN_ACCT_UNIT    IN VARCHAR2                   /* 회계단위 */
        ,IN_ACCT_GUBN    IN VARCHAR2                   /* 사업장 */
    );

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 손익계산서 생성
    ********************************************************************************/
    PROCEDURE SP_SAVE_PL (
         IN_UPDT_USID    IN VARCHAR2                   /* 작업자 */
        ,IN_BASE_YYM1    IN VARCHAR2                   /* 당기시작월 */
        ,IN_BASE_YYM2    IN VARCHAR2                   /* 당기종료월 */
        ,IN_PREV_YYM1    IN VARCHAR2                   /* 전기시작월 */
        ,IN_PREV_YYM2    IN VARCHAR2                   /* 전기종료월 */
        ,IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
        ,IN_ACCT_UNIT    IN VARCHAR2                   /* 회계단위 */
        ,IN_ACCT_GUBN    IN VARCHAR2                   /* 사업장 */
    );

    /*******************************************************************************
        작  성  자 : 권미영
        작  성  일 : 2016.10.13
        내     용 : 월별 손익계산서 생성
    ********************************************************************************/
    PROCEDURE SP_SAVE_PL_MONTH (
         IN_UPDT_USID    IN VARCHAR2                   /* 작업자 */
        ,IN_BASE_YYM1    IN VARCHAR2                   /* 당기시작월 */
        ,IN_BASE_YYM2    IN VARCHAR2                   /* 당기종료월 */
        ,IN_FSFM_CODE    IN VARCHAR2                   /* 양식 */
        ,IN_ACCT_UNIT    IN VARCHAR2                   /* 회계단위 */
        ,IN_ACCT_GUBN    IN VARCHAR2                   /* 사업장 */
    );


    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 재무제표 레벨정리
    ********************************************************************************/
    PROCEDURE SP_SAVE_LEVL (
         IN_VIEW_ITLV    IN VARCHAR2                   /* 양식항목레벨 */
    );

    /*******************************************************************************
        작  성  자 : 하창연
        작  성  일 : 2016.02.05
        내     용 : 계정잔액
    ********************************************************************************/
    FUNCTION SF_ACCT_BALA (
         IN_DRCR_GUBN     IN VARCHAR2      /* 차대구분 */
        ,IN_CHAX_AMNT     IN NUMBER        /* 차변금액*/
        ,IN_DAEX_AMNT     IN NUMBER        /* 대변금액*/
    )
    RETURN NUMBER;

END PKG_FAMF0010;
/